---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsPathPositionResetWarning
source: html/b61b3405-bc4e-ccb2-1a7d-e120494968f4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsPathPositionResetWarning Property

The stairs path doesn't intersect with riser lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsPathPositionResetWarning { get; }
```